/**
 * Created by Neo on 18/7/14.
 */

var swordData = angular.module('SwordData', []);

swordData.value('swordData',
  [{
    'name': '龙剑',
    'desc': '晋库走龙剑，吴室荡燕雏。翠帷双卷出顷城，龙剑破匣双月明。'
  },
    {
      'name': '照胆',
      'desc': '武丁在位五十九年，以元年岁次午铸一剑，长三尺，铭曰「照胆」，古文篆书。'
    },
    {
      'name': '金剑',
      'desc': '章帝建初八年，铸金剑令投于伊水中，以压人膝之怪。'
    },
    {
      'name': '王氏剑',
      'desc': '王氏剑，天下利器也。'
    },
    {
      'name': '大剑',
      'desc': '周太祖出镇魏州，弘肇议带枢密以行，苏逢吉场邻以为不可，弘肇恨之，明日会饮窦贞固第，弘肇曰：『安朝庭定祸乱，直须长剑大剑，若毛锥子安足用哉。』'
    },
    {
      'name': '隋刃',
      'desc': '亦名浪剑。剑身用毒药炼铸，伤人即死。隋刃，铸时以毒药并冶，取迎曜如星者，凡十年用成，淬以马血，以金犀饰镡首，伤人即死。浪人所铸故亦名浪剑。'
    },
    {
      'name': '浪人剑',
      'desc': '为浪人所铸。贞观元十年九月辛卯，诏献锋槊、浪人剑。亦名『浪剑』。'
    },
    {
      'name': '疥痨宾',
      'desc': '古代剑名。'
    },
    {
      'name': '青霜',
      'desc': '古代名剑。此剑之剑光青凛若霜雪，故名。'
    },
    {
      'name': '鸦九剑',
      'desc': '剑师张鸦九所造之剑。欧治子死千年后，精灵暗授张鸦九，鸦九铸剑吴山中，天与日时神借功。'
    },
    {
      'name': '灵宝剑',
      'desc': '钱塘闻人绍，一剑削十大钉皆截，剑无纤迹；用力屈之如钩，纵之铿锵有声，复直如弦。古之所谓灵宝剑也。'
    },
    {
      'name': '裴旻剑',
      'desc': '利剑。'
    },
    {
      'name': '破山剑',
      'desc': '古名剑。有农夫耕地得剑，磨洗适市，值贾胡售以百千，未可，至百万，约来日取之。夜归语妻子，此何异而价至。是庭中有石，偶以剑指之，立碎。诘旦，胡人载镪呈，则叹叱曰：剑光已尽，不复买。农夫苦问之。曰：是破山剑，唯一可用，吾欲持之破宝山耳。'
    },
    {
      'name': '青蛇',
      'desc': '古剑名。'
    },
    {
      'name': '火精',
      'desc': '古名剑。有山，方数百里，出神铁。其山有瘅毒，不可轻为采取。若中国之君有道，神铁则自流炼之为剑，必多灵异。其剑之光如电，切金如泥。以朽磨之，则生烟焰；以金石击之，则火光流起。'
    },
    {
      'name': '折铁宝剑',
      'desc': '古名剑。状似刀，仅一侧有刃，另一侧是背，上有一窄凹槽。剑身中间印有宽凹槽，长三尺四寸三分，重一斤四两。状极古雅，有刚柔力，能弯曲自如。单双手持之，无往不利。'
    },
    {
      'name': '干将',
      'desc': '古名剑。干将，本人名，相传他与其妻莫邪铸有名剑二枚，因以名其剑。《吴越春秋·阖闾内传》：『请干将作名剑二枝。干将者，吴人也；莫邪，干将之妻也。干将作剑，金铁之精不流，于是干将夫妻，乃断发剪爪，投于炉中，金铁乃濡，遂以成剑，阳曰干将，阴曰莫邪。』一说干将、莫邪铸剑，铁汁不流，莫邪投身于炉而成剑。'
    },
    {
      'name': '莫邪',
      'desc': '古宝剑名。或作『镆邪』、『镆铘』、『莫铘』。吴王阖闾使干将铸剑，铁汁不流。干将妻莫邪问该如何办，干将说：从前先师欧冶子铸剑时，曾以女子配炉神，即得。莫邪闻言即投身炉中，铁汁出，铸成二剑。雄剑叫“干将”，雌剑叫『莫邪』。'
    },
    {
      'name': '墨阳',
      'desc': '古名剑。墨阳即为地名，又因地而剑，成为著名宝剑，同是也是铸剑师的姓名。 '
    },
    {
      'name': '龙渊',
      'desc': '古宝剑名。相传春秋时楚王令欧冶子、干将师徒铸铁剑。欧冶子、干将作成铁剑三支：一名龙渊、二名太阿、三名工布，献给楚王。楚王见后非常高兴，问道：『何谓龙渊、太阿、工布？』答曰：『欲知龙渊，观其状，如登高山，临深渊；欲知太阿，观其纹，巍巍翼翼，如流水之波；欲知工布，纹从文起，至脊而止，如珠不可衽，文若流水不绝。'
    },
    {
      'name': '太阿',
      'desc': '古代宝剑名。相传为欧冶子、干将所铸。也作“泰阿”。《战国策—韩策一》：『韩卒之剑戟，龙渊、太阿，皆陆断马牛，水击鹄雁』。《史记—李斯列传》：『服大阿之剑，乘纤离之马』。'
    },
    {
      'name': '胜邪',
      'desc': '春秋时期越国冶师欧冶子所铸五大名剑之一。工布：古名剑。《欧冶子，干将凿茨山，汇其溪，取铁英，作为铁剑三枚：一曰龙渊，二曰泰阿，三曰工布。'
    },
    {
      'name': '磐郢',
      'desc': '古名剑。吴王得越所献宝剑三枚。一曰鱼肠，二曰磐郢，三曰湛泸。一作『豪曹』。'
    },
    {
      'name': '湛卢',
      'desc': '古代宝剑名。相传为春秋时人欧冶子所铸。欧冶子乃因天之精神，悉其伎巧，造为大刑三，小刑二：一曰湛卢，二曰纯钩，三曰胜邪，四曰鱼肠，五曰巨阙。吴王阖庐之时，得其胜邪、鱼肠、湛卢。相传欧冶子所铸五大名剑为三大二小。其大者有湛卢、纯钧、胜邪；其小者有鱼肠、世阙。湛泸宝剑因通体『湛湛然黑色也』而得名。一作『冗卢』。'
    },
    {
      'name': '鱼肠',
      'desc': '春秋时期越国冶师欧冶子所铸五大剑之一。又名『蟠钢』，『松纹』。'
    },
    {
      'name': '巨阙',
      'desc': '古宝剑名。相传为春秋时人欧冶子所铸。阖闾之干将、莫邪、巨阙、辟闾，皆古之良剑也。'
    },
    {
      'name': '纯钧',
      'desc': '古宝剑名。相传为春秋时人欧冶子所铸。越王勾践有宝剑五，闻于天下。客有能相剑者名薛烛，王召而问之，客曰：扬其华，揪如芙蓉始出，观其纹，烂如列星之行，观其光，浑浑如水之溢于塘，观其断，岩岩如琐石，观其才，焕焕如冰释，此所谓纯钩耶。又名『纯钩』。'
    },
    {
      'name': '燕支',
      'desc': '古名剑。断蛇、鱼肠、纯钩、燕支、蔡愉、属镂、干胜、墨阳，并称名剑。'
    },
    {
      'name': '蔡愉',
      'desc': '古名剑。'
    },
    {
      'name': '画影',
      'desc': '传说中古代部族首领颛顼所用的宝剑。颛顼高阳氏有画影剑、空剑。若四方有兵，此剑飞赴，指其方则克，未用时在匣中，常如龙虎啸吟。'
    },
    {
      'name': '腾空',
      'desc': '传说中古代部族道领颛顼所用的宝剑。瑞顼高阳氏有画影剑、腾空剑。'
    },
    {
      'name': '轩辕剑',
      'desc': '古名剑。轩辕采首山之铜，铸剑，以天之古字题名。'
    },
    {
      'name': '启剑',
      'desc': '古名剑。相传为夏禹之了启在位时所铸。夏禹子帝启在位十年，对庚戍八年铸一铜剑，长三尺九寸，后藏之秦塑山，腹上刻二十八宿，文有背面。面文为星辰，背记山月日月。'
    },
    {
      'name': '夹剑',
      'desc': '古名剑。传说殷帝孔甲在位时所铸。孔甲在位三十一年，以九年岁次甲辰，采牛首山铁，铸一剑，铭名曰「夹」，古文篆书，长四尺一雨。'
    },
    {
      'name': '太康',
      'desc': '古名剑。以此剑造于殷帝太康在位时，故名。启子太康在位二十九年，岁在三月辛卯春，铸一铜剑，上有八方面，长三尺三寸头，头方。'
    },
    {
      'name': '定光',
      'desc': '古剑名。传说殷帝太甲在位时所铸。殷太甲在位三十二年，以四年岁次甲子铸一剑，长二尺，文曰『定光』，古文篆书。'
    },
    {
      'name': '含光',
      'desc': '古名剑。春秋时卫人孔周藏有殷代留下来的三把宝剑：含光、承影、宵练。孔周曰：『吾有三剑，惟子所择。一曰含光，视不可见，运之不知其所触，泯然无际，经物而物不觉。』'
    },
    {
      'name': '承影',
      'desc': '古名剑：为春秋时卫人孔周所藏。孔周曰：『吾有三剑，惟子所择。二曰‘承影’，味爽之交，日夕昏有之际，北面察之，淡炎焉若有物存，莫有其状。其触物也，窃然有声，经物而物不见。』'
    },
    {
      'name': '宵练',
      'desc': '古名剑。为春秋时期卫人孔周所藏。孔周曰：『吾有三剑；惟子所择，三曰「宵练」，方昼则见影不见光，方夜则见方而不见形。其触物也，骜然而过，随过随合，觉疾而不血刃焉』。一作「霄练」。'
    },
    {
      'name': '夏禹剑',
      'desc': '古名剑。传说为夏朝大禹时所铸。夏禹铸一剑，藏会稽山，腹上刻二十八宿，文有背面，文为日月星辰，背记山川。'
    },
    {
      'name': '铜剑',
      'desc': '古剑名。以铜铸成。夏君在位，以庚茂八铸一铜剑。'
    },
    {
      'name': '锟鋙',
      'desc': '古名剑。周穆王大征西戎，西戎献锟之剑，……切玉如泥。亦作昆吾。'
    },
    {
      'name': '轻吕',
      'desc': '古名剑。武王答拜。先入，适王所，乃施射之，三发而后下车，而击之以轻吕，斩之以典钺。'
    },
    {
      'name': '镇岳尚方剑',
      'desc': '古名剑。相传为西周时期昭王瑕在位时所铸的宝剑。昭王瑕在位五十一年，以二年岁次壬午，铸五剑，名五岳，铭曰：『镇岳尚书』，古文篆书，长五尺。'
    },
    {
      'name': '掩日',
      'desc': '春秋时期越王勾践所督铸的八把长剑之一。'
    },
    {
      'name': '断水',
      'desc': '春秋时期越王勾践所督铸的八把长剑之二。'
    },
    {
      'name': '转魄',
      'desc': '春秋时期越王勾践所督铸的八把长剑之三。'
    },
    {
      'name': '悬翦',
      'desc': '春秋时期越王勾践所督造的八把长剑之四。'
    },
    {
      'name': '惊鲵',
      'desc': '春秋时期越王勾践所督铸的八把长剑之五。'
    },
    {
      'name': '灭魂',
      'desc': '春秋时期越王勾践所督铸的八把长剑之六。'
    },
    {
      'name': '却邪',
      'desc': '春秋时期越王勾践所督铸的八把长剑之七。'
    },
    {
      'name': '真刚',
      'desc': '春秋时期越王勾践所督铸的八把长剑之八。'
    },
    {
      'name': '光剑',
      'desc': '古名剑。春秋时吴王夫差所用之物，长约一尺五寸，茎为圆柱形，有两道箍棱。剑身有两行阴刻篆字，铭文『攻玉王光自（乍）用剑以战茂人。』为安徽省南陵县出土文物。'
    },
    {
      'name': '吴王剑',
      'desc': '古名剑。当时吴王剑，砺光裂岩幽。'
    },
    {
      'name': '吴王夫差剑',
      'desc': '古剑名。为春秋时期吴国君主夫差所用。剑身上有阴刻篆字铭文：『攻吾王夫差自作其之用。』'
    },
    {
      'name': '吴越剑',
      'desc': '古名剑。郑之刀，宋之斤，鲁之削，吴越之剑，迁手其他而弗能为良，地气然也。'
    },
    {
      'name': '永用剑',
      'desc': '古名剑。永用剑是铜质铸，为古吴季子之子逞之佩剑，此剑式样颇小，度为古代佩持之手剑。此刻全长一尺五寸六分，重为一斤六两，剑柄较短。'
    },
    {
      'name': '伍子胥剑',
      'desc': '春秋时吴国大夫伍子胥所带宝剑。伍子剑，在澹台潮中，长五尺许，有伍子胥，时浮水面，人取之必病，弃之好安。'
    },
    {
      'name': '必卢',
      'desc': '古名剑。越王赐文种属卢之剑。一作『属镂』。'
    },
    {
      'name': '越王勾践剑',
      'desc': '古剑名。为春秋越国君主勾践所用。上有铭文曰：『越王鸠浅自作用剑。』鸠浅即勾践。'
    },
    {
      'name': '步光',
      'desc': '春秒时期越国名剑。越使大夫种言于吴王，曰：『闻大王将兴丈义，因奉屈虏之矛，步光之剑。』'
    },
    {
      'name': '扁诸',
      'desc': '古剑名。吴败齐师于艾陵之上，还师临晋与定公争长。吴师皆文犀长盾，扁诸之剑，方阵而行。'
    },

    {
      'name': '时耗',
      'desc': '古名剑。扁诸之剑三斤，方圆之口三千。时耗、鱼肠之剑在焉。'
    },
    {
      'name': '长扬剑',
      'desc': '春秋钢剑。'
    },
    {
      'name': '长铗',
      'desc': '古宝剑名。较一般剑为长。《楚辞·九章·涉江》：『带长铗之陆离兮！』长挟，剑名，其所带长剑，楚人名为长铗也。'
    },
    {
      'name': '阳剑',
      'desc': '古名剑。楚之阳剑，欧治所营。'
    },
    {
      'name': '定秦',
      'desc': '古名剑。相传为秦始皇所铸之剑。秦始皇在位三十七岁，以三年岁次丁已，采北祗铜铸二剑，名曰『定秦』，小篆书。李斯书，长三尺六十。'
    },
    {
      'name': '诫剑',
      'desc': '古名剑。传说为秦昭王稷在位时所铸。秦昭王稷在位五十二年，以元年岁次丙午铸一剑，长三尺，铭曰『诫』，大篆书。'
    },
    {
      'name': '水心',
      'desc': '古名剑。秦昭王以三月置酒河曲，见金人奉水心之剑。'
    },
    {
      'name': '赤霄',
      'desc': '汉高祖刘邦斩蛇所用之剑。刘季在位十二年，以始皇三十四年，于南山得一铁剑，长三尺，铭曰『赤霄』，大篆书。'
    },
    {
      'name': '斩蛇剑',
      'desc': '一名『斩蛇』。汉高祖刘邦白蛇之宝剑。高祖斩白蛇剑，十二年一加磨莹，刃上常若霜雪。'
    },
    {
      'name': '秀霸',
      'desc': '汉光武帝刘秀所佩之剑。'
    },
    {
      'name': '分景',
      'desc': '古名剑。王母腰佩分景之剑。'
    },
    {
      'name': '崩剑',
      'desc': '古名剑。汉平帝所用的宝剑。汉平帝在位五年，以元始元年掘得一剑，上有帝名。因服之，大篆书。'
    },
    {
      'name': '神龟',
      'desc': '古名剑。汉文帝剂恒在位时所铸。文帝恒在位二十三年，以初元十六年岁次庚午铸二剑，长三尺六寸，铭曰『神龟』。多刻龟形以应大横之兆。'
    },
    {
      'name': '随侯剑',
      'desc': '古剑名。又以方土言，为随侯剑，宝玉、宝璧、周康宝鼎，立四祠于未央宫中。'
    },
    {
      'name': '飞景',
      'desc': '三国时魏文帝曹丕命能工铸造的三把宝剑之一。曹丕《曹论》：『建安二十四年二月壬午，选兹良金，命彼国工，精而炼之，至于百辟，浃以清漳，光似流星，名曰飞景。』一作『蜚景』。'
    },
    {
      'name': '流采',
      'desc': '三国时魏文帝曹丕命能工铸造的三把宝剑之二。'
    }]
);